---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidParameterValue
source: html/c571a7e3-c960-d556-7f8d-698f57f68378.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidParameterValue Property

Parameter [Caption] has an invalid value.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidParameterValue { get; }
```